In [56]:
import pandas as pd
import numpy as np
import csv

In [57]:
data = [1,23,5,9]
data

[1, 23, 5, 9]

In [58]:
pd.DataFrame(data=data, columns=["col1"], index=["a","b","c","d"])

   col1
a     1
b    23
c     5
d     9

In [59]:
df = pd.DataFrame(np.arange(1,24,2).reshape(6,2),columns=["col1","col2"])
df

   col1  col2
0     1     3
1     5     7
2     9    11
3    13    15
4    17    19
5    21    23

In [60]:
df.sample(3)

   col1  col2
3    13    15
2     9    11
5    21    23

In [61]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [62]:
df.columns

Index(['col1', 'col2'], dtype='object')

In [63]:
df.columns = [100,200]
df

   100  200
0    1    3
1    5    7
2    9   11
3   13   15
4   17   19
5   21   23

In [64]:
df.shape

(6, 2)

In [65]:
# Creating a DataFrame using a dict

In [66]:
s1 = np.random.randint(2,10,size=4) 
s2 = np.random.randint(3,10,size=4) 
s3 = np.random.randint(4,10,size=4)

In [67]:
my_dict = {"var1":s1,"var2":s2, "var3":s3}
my_dict

{'var1': array([6, 2, 7, 5]),
 'var2': array([4, 5, 3, 7]),
 'var3': array([5, 6, 6, 5])}

In [68]:
pd.DataFrame(my_dict)

   var1  var2  var3
0     6     4     5
1     2     5     6
2     7     3     6
3     5     7     5

In [69]:
pd.DataFrame(data = {"quinn":np.random.randint(2,10,size=2),
                      "pat": np.ones((2,)),
                      "mike": np.zeros((2,))},
             index=["red","blue"],
             dtype=np.int16)

      quinn  pat  mike
red       2    1     0
blue      8    1     0

In [70]:
df = pd.read_csv("/Users/neslihanyetik/Desktop/Data/ornekcsv.csv", delimiter=';')
df
#delimiter specifies the character used to separate each field. The default is the comma (',').

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [71]:
df[1:3]

    a    b    c
1  78   12  2.0
2  78  324  3.0

In [72]:
df1 = pd.DataFrame(my_dict)
df1

   var1  var2  var3
0     6     4     5
1     2     5     6
2     7     3     6
3     5     7     5

In [73]:
df1.index = ["a","b","c","d"]
df1

   var1  var2  var3
a     6     4     5
b     2     5     6
c     7     3     6
d     5     7     5

In [74]:
df1["b":"d"]

   var1  var2  var3
b     2     5     6
c     7     3     6
d     5     7     5

In [75]:
"c" in df1.index

True

In [76]:
"var1" in df1

True

In [77]:
# Pandas isin() method is used to filter data frames. isin() method helps in selecting rows
# with having a particular(or Multiple) value in a particular column.

df1.isin([2,7,0])

    var1   var2   var3
a  False  False  False
b   True  False  False
c   True  False  False
d  False   True  False

In [78]:
from numpy.random import randn

In [79]:
np.random.seed(100)
np.random.rand()

0.5434049417909654

In [158]:
np.random.seed(1)
df3 = pd.DataFrame(randn(5,4), 
             'a b c d e'.split(), 
             'w x y z'.split())
df3

          w         x         y         z
a  1.624345 -0.611756 -0.528172 -1.072969
b  0.865408 -2.301539  1.744812 -0.761207
c  0.319039 -0.249370  1.462108 -2.060141
d -0.322417 -0.384054  1.133769 -1.099891
e -0.172428 -0.877858  0.042214  0.582815

In [81]:
df3["z"] # seri

a   -1.072969
b   -0.761207
c   -2.060141
d   -1.099891
e    0.582815
Name: z, dtype: float64

In [82]:
type(df3["z"])

pandas.core.series.Series

In [83]:
df3[["z"]] # df

          z
a -1.072969
b -0.761207
c -2.060141
d -1.099891
e  0.582815

In [84]:
type(df3[["z"]])

pandas.core.frame.DataFrame

In [85]:
df3[["x","w"]]

          x         w
a -0.611756  1.624345
b -2.301539  0.865408
c -0.249370  0.319039
d -0.384054 -0.322417
e -0.877858 -0.172428

In [86]:
df3

          w         x         y         z
a  1.624345 -0.611756 -0.528172 -1.072969
b  0.865408 -2.301539  1.744812 -0.761207
c  0.319039 -0.249370  1.462108 -2.060141
d -0.322417 -0.384054  1.133769 -1.099891
e -0.172428 -0.877858  0.042214  0.582815

In [87]:
x = df3.copy()
x.columns =["a b c d".split()]
x 
# yeni df oluşturduk.

          a         b         c         d
a  1.624345 -0.611756 -0.528172 -1.072969
b  0.865408 -2.301539  1.744812 -0.761207
c  0.319039 -0.249370  1.462108 -2.060141
d -0.322417 -0.384054  1.133769 -1.099891
e -0.172428 -0.877858  0.042214  0.582815

In [88]:
x["b":"d"]

          a         b         c         d
b  0.865408 -2.301539  1.744812 -0.761207
c  0.319039 -0.249370  1.462108 -2.060141
d -0.322417 -0.384054  1.133769 -1.099891

In [89]:
df3

          w         x         y         z
a  1.624345 -0.611756 -0.528172 -1.072969
b  0.865408 -2.301539  1.744812 -0.761207
c  0.319039 -0.249370  1.462108 -2.060141
d -0.322417 -0.384054  1.133769 -1.099891
e -0.172428 -0.877858  0.042214  0.582815

In [90]:
df3['x*y'] = df3['x'] * df3['y']

In [91]:
df3

          w         x         y         z       x*y
a  1.624345 -0.611756 -0.528172 -1.072969  0.323112
b  0.865408 -2.301539  1.744812 -0.761207 -4.015752
c  0.319039 -0.249370  1.462108 -2.060141 -0.364606
d -0.322417 -0.384054  1.133769 -1.099891 -0.435429
e -0.172428 -0.877858  0.042214  0.582815 -0.037058

In [92]:
df3["xxx"] = 11

In [93]:
df3

          w         x         y         z       x*y  xxx
a  1.624345 -0.611756 -0.528172 -1.072969  0.323112   11
b  0.865408 -2.301539  1.744812 -0.761207 -4.015752   11
c  0.319039 -0.249370  1.462108 -2.060141 -0.364606   11
d -0.322417 -0.384054  1.133769 -1.099891 -0.435429   11
e -0.172428 -0.877858  0.042214  0.582815 -0.037058   11

In [94]:
df3.drop(["x*y","xxx"], axis=1, inplace=True)

In [95]:
df3

          w         x         y         z
a  1.624345 -0.611756 -0.528172 -1.072969
b  0.865408 -2.301539  1.744812 -0.761207
c  0.319039 -0.249370  1.462108 -2.060141
d -0.322417 -0.384054  1.133769 -1.099891
e -0.172428 -0.877858  0.042214  0.582815

In [97]:
df4=df3.drop('c',axis=0)
df4

          w         x         y         z
a  1.624345 -0.611756 -0.528172 -1.072969
b  0.865408 -2.301539  1.744812 -0.761207
d -0.322417 -0.384054  1.133769 -1.099891
e -0.172428 -0.877858  0.042214  0.582815

In [ ]:
#Selecting Rows
# .loc[] → allows us to select data using labels (names) of rows (index) & columns
# .iloc[] → allows us to select data using index numbers of rows (index) & columns. it's like classical indexing logic

In [98]:
m = np.random.randint(1,40, size=(8,4))
df5 = pd.DataFrame(data=m, columns=['var1', 'var2', 'var3', 'var4'])
df5

   var1  var2  var3  var4
0     5    25    13    27
1    17    19    16     1
2     5    26    35    24
3     8    27    26    23
4    10     4    24    37
5    28    38    20    39
6     9    33    35    11
7    24    16    24    26

In [100]:
df5.loc[3]

var1     8
var2    27
var3    26
var4    23
Name: 3, dtype: int64

In [103]:
df5.loc[2:5] # 5 dahil !!

   var1  var2  var3  var4
2     5    26    35    24
3     8    27    26    23
4    10     4    24    37
5    28    38    20    39

In [104]:
df5.iloc[2:5]

   var1  var2  var3  var4
2     5    26    35    24
3     8    27    26    23
4    10     4    24    37

In [111]:
df5.index = "a b c d e f g h".split()
df5

   var1  var2  var3  var4
a     5    25    13    27
b    17    19    16     1
c     5    26    35    24
d     8    27    26    23
e    10     4    24    37
f    28    38    20    39
g     9    33    35    11
h    24    16    24    26

In [112]:
df5.loc["c":"g"]

   var1  var2  var3  var4
c     5    26    35    24
d     8    27    26    23
e    10     4    24    37
f    28    38    20    39
g     9    33    35    11

In [113]:
df5.loc["b":"f"][["var2","var4"]]

   var2  var4
b    19     1
c    26    24
d    27    23
e     4    37
f    38    39

In [118]:
df5.iloc[2:5,3] # satırda 2den 5 kadar olan ve 3. sütuna göre seçiyoruz.

c    24
d    23
e    37
Name: var4, dtype: int64

In [159]:
df3

          w         x         y         z
a  1.624345 -0.611756 -0.528172 -1.072969
b  0.865408 -2.301539  1.744812 -0.761207
c  0.319039 -0.249370  1.462108 -2.060141
d -0.322417 -0.384054  1.133769 -1.099891
e -0.172428 -0.877858  0.042214  0.582815

In [121]:
df3.loc["a", :]

w    1.624345
x   -0.611756
y   -0.528172
z   -1.072969
Name: a, dtype: float64

In [123]:
df3.loc[:,"w"]

a    1.624345
b    0.865408
c    0.319039
d   -0.322417
e   -0.172428
Name: w, dtype: float64

In [125]:
df3.iloc[0,:]

w    1.624345
x   -0.611756
y   -0.528172
z   -1.072969
Name: a, dtype: float64

In [131]:
df3.iloc[:,0]

a    1.624345
b    0.865408
c    0.319039
d   -0.322417
e   -0.172428
Name: w, dtype: float64

In [132]:
df3.iloc[:,[0]] # df olarak cıktı istersen liste içine almalısın.

          w
a  1.624345
b  0.865408
c  0.319039
d -0.322417
e -0.172428

In [135]:
df3.loc[["b","d"],["x","y"]]

          x         y
b -2.301539  1.744812
d -0.384054  1.133769

In [138]:
df3.iloc[[1,3],[1,2]]

          x         y
b -2.301539  1.744812
d -0.384054  1.133769

In [139]:
df3

          w         x         y         z
a  1.624345 -0.611756 -0.528172 -1.072969
b  0.865408 -2.301539  1.744812 -0.761207
c  0.319039 -0.249370  1.462108 -2.060141
d -0.322417 -0.384054  1.133769 -1.099891
e -0.172428 -0.877858  0.042214  0.582815

In [140]:
df3[df3 > .5]

          w   x         y         z
a  1.624345 NaN       NaN       NaN
b  0.865408 NaN  1.744812       NaN
c       NaN NaN  1.462108       NaN
d       NaN NaN  1.133769       NaN
e       NaN NaN       NaN  0.582815

In [141]:
df3[df3["y"] > .3]

          w         x         y         z
b  0.865408 -2.301539  1.744812 -0.761207
c  0.319039 -0.249370  1.462108 -2.060141
d -0.322417 -0.384054  1.133769 -1.099891

In [143]:
df3[df3["y"]>0][["x","z"]]

          x         z
b -2.301539 -0.761207
c -0.249370 -2.060141
d -0.384054 -1.099891
e -0.877858  0.582815

In [144]:
df3[(df3['w']>0) & (df3['y']<1)]

          w         x         y         z
a  1.624345 -0.611756 -0.528172 -1.072969

In [150]:
df3.loc[(df3.x>-1),["x","y"]]

          x         y
a -0.611756 -0.528172
c -0.249370  1.462108
d -0.384054  1.133769
e -0.877858  0.042214

In [154]:
df3.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [160]:
df3.reset_index(inplace=True)
df3

  index         w         x         y         z
0     a  1.624345 -0.611756 -0.528172 -1.072969
1     b  0.865408 -2.301539  1.744812 -0.761207
2     c  0.319039 -0.249370  1.462108 -2.060141
3     d -0.322417 -0.384054  1.133769 -1.099891
4     e -0.172428 -0.877858  0.042214  0.582815

In [163]:
df3.index = df3["index"]
df3

      index         w         x         y         z
index
a         a  1.624345 -0.611756 -0.528172 -1.072969
b         b  0.865408 -2.301539  1.744812 -0.761207
c         c  0.319039 -0.249370  1.462108 -2.060141
d         d -0.322417 -0.384054  1.133769 -1.099891
e         e -0.172428 -0.877858  0.042214  0.582815

In [164]:
df3.reset_index(drop=True, inplace=True)

In [165]:
df3

  index         w         x         y         z
0     a  1.624345 -0.611756 -0.528172 -1.072969
1     b  0.865408 -2.301539  1.744812 -0.761207
2     c  0.319039 -0.249370  1.462108 -2.060141
3     d -0.322417 -0.384054  1.133769 -1.099891
4     e -0.172428 -0.877858  0.042214  0.582815

In [166]:
df3.drop("index", axis=1, inplace=True)

In [167]:
df3

          w         x         y         z
0  1.624345 -0.611756 -0.528172 -1.072969
1  0.865408 -2.301539  1.744812 -0.761207
2  0.319039 -0.249370  1.462108 -2.060141
3 -0.322417 -0.384054  1.133769 -1.099891
4 -0.172428 -0.877858  0.042214  0.582815

In [168]:
newix = ['ca', 'ny', 'or', 'co', 'nh']
df3["newix"] = newix
df3

          w         x         y         z newix
0  1.624345 -0.611756 -0.528172 -1.072969    ca
1  0.865408 -2.301539  1.744812 -0.761207    ny
2  0.319039 -0.249370  1.462108 -2.060141    or
3 -0.322417 -0.384054  1.133769 -1.099891    co
4 -0.172428 -0.877858  0.042214  0.582815    nh

In [169]:
df3.set_index('newix')  # NOT inplace=True

              w         x         y         z
newix
ca     1.624345 -0.611756 -0.528172 -1.072969
ny     0.865408 -2.301539  1.744812 -0.761207
or     0.319039 -0.249370  1.462108 -2.060141
co    -0.322417 -0.384054  1.133769 -1.099891
nh    -0.172428 -0.877858  0.042214  0.582815

In [171]:
outside = ['M1', 'M1', 'M1', 'M2', 'M2', 'M2','M3', 'M3', 'M3']
inside = [1, 2, 3, 1, 2, 3, 5, 6, 7]
multi_index = list(zip(outside,inside))
multi_index

[('M1', 1),
 ('M1', 2),
 ('M1', 3),
 ('M2', 1),
 ('M2', 2),
 ('M2', 3),
 ('M3', 5),
 ('M3', 6),
 ('M3', 7)]

In [175]:
hier_index=pd.MultiIndex.from_tuples(multi_index)
hier_index

MultiIndex([('M1', 1),
            ('M1', 2),
            ('M1', 3),
            ('M2', 1),
            ('M2', 2),
            ('M2', 3),
            ('M3', 5),
            ('M3', 6),
            ('M3', 7)],
           )

In [176]:
df6 = pd.DataFrame(np.random.randn(9,4),
                  index=hier_index,
                  columns=['A','B','C','D'])
df6

             A         B         C         D
M1 1 -1.100619  1.144724  0.901591  0.502494
   2  0.900856 -0.683728 -0.122890 -0.935769
   3 -0.267888  0.530355 -0.691661 -0.396754
M2 1 -0.687173 -0.845206 -0.671246 -0.012665
   2 -1.117310  0.234416  1.659802  0.742044
   3 -0.191836 -0.887629 -0.747158  1.692455
M3 5  0.050808 -0.636996  0.190915  2.100255
   6  0.120159  0.617203  0.300170 -0.352250
   7 -1.142518 -0.349343 -0.208894  0.586623

In [182]:
df6.loc["M2"].loc[[2]]

         A         B         C         D
2 -1.11731  0.234416  1.659802  0.742044

In [184]:
df6.xs("M1")

          A         B         C         D
1 -1.100619  1.144724  0.901591  0.502494
2  0.900856 -0.683728 -0.122890 -0.935769
3 -0.267888  0.530355 -0.691661 -0.396754

In [186]:
df6.loc["M1"]

          A         B         C         D
1 -1.100619  1.144724  0.901591  0.502494
2  0.900856 -0.683728 -0.122890 -0.935769
3 -0.267888  0.530355 -0.691661 -0.396754

In [188]:
df6.xs(("M3",7))

A   -1.142518
B   -0.349343
C   -0.208894
D    0.586623
Name: (M3, 7), dtype: float64

In [191]:
df6.xs(3, level = 1)

           A         B         C         D
M1 -0.267888  0.530355 -0.691661 -0.396754
M2 -0.191836 -0.887629 -0.747158  1.692455

In [190]:
df6.xs(('M3',7), level=[0,1])

             A         B         C         D
M3 7 -1.142518 -0.349343 -0.208894  0.586623

In [192]:
import seaborn as sns

In [193]:
df=sns.load_dataset('iris')
df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [198]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [196]:
df.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [199]:
df.shape

(150, 5)

In [201]:
df.ndim

2

In [203]:
df.size

750

In [204]:
df.sample(3)

    sepal_length  sepal_width  petal_length  petal_width     species
86           6.7          3.1           4.7          1.5  versicolor
12           4.8          3.0           1.4          0.1      setosa
39           5.1          3.4           1.5          0.2      setosa

In [205]:
df.species.value_counts()

virginica     50
setosa        50
versicolor    50
Name: species, dtype: int64

In [206]:
df.mean()

sepal_length    5.843333
sepal_width     3.057333
petal_length    3.758000
petal_width     1.199333
dtype: float64

In [207]:
df.species.unique()

array(['setosa', 'versicolor', 'virginica'], dtype=object)

In [208]:
df.isnull()

     sepal_length  sepal_width  petal_length  petal_width  species
0           False        False         False        False    False
1           False        False         False        False    False
2           False        False         False        False    False
3           False        False         False        False    False
4           False        False         False        False    False
..            ...          ...           ...          ...      ...
145         False        False         False        False    False
146         False        False         False        False    False
147         False        False         False        False    False
148         False        False         False        False    False
149         False        False         False        False    False

[150 rows x 5 columns]

In [209]:
df.isnull().sum()

sepal_length    0
sepal_width     0
petal_length    0
petal_width     0
species         0
dtype: int64

In [210]:
df.iloc[0:7,:]

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa
6           4.6          3.4           1.4          0.3  setosa

In [211]:
df.loc[:7,:]

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa
6           4.6          3.4           1.4          0.3  setosa
7           5.0          3.4           1.5          0.2  setosa

In [212]:
df.drop("species",axis=1)

     sepal_length  sepal_width  petal_length  petal_width
0             5.1          3.5           1.4          0.2
1             4.9          3.0           1.4          0.2
2             4.7          3.2           1.3          0.2
3             4.6          3.1           1.5          0.2
4             5.0          3.6           1.4          0.2
..            ...          ...           ...          ...
145           6.7          3.0           5.2          2.3
146           6.3          2.5           5.0          1.9
147           6.5          3.0           5.2          2.0
148           6.2          3.4           5.4          2.3
149           5.9          3.0           5.1          1.8

[150 rows x 4 columns]

In [213]:
df[(df.sepal_length>5) & (df.sepal_width>3)].head()

    sepal_length  sepal_width  petal_length  petal_width species
0            5.1          3.5           1.4          0.2  setosa
5            5.4          3.9           1.7          0.4  setosa
10           5.4          3.7           1.5          0.2  setosa
14           5.8          4.0           1.2          0.2  setosa
15           5.7          4.4           1.5          0.4  setosa

In [214]:
df[(df.sepal_length>5) | (df.sepal_width>3)].tail()

     sepal_length  sepal_width  petal_length  petal_width    species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica